// Задание 1
// Необходимо с помощью цикла for вывести следующие 11 строк в консоль:
// 0 – это ноль
// 1 – нечетное число
// 2 – четное число
// 3 – нечетное число
// …
// 10 – четное число
        
        
        // function isEven(a) {
        //     return a % 2 === 0;
        // }

        // for (let i = 0; i < 11; i++) {
        //     if (i === 0) {
        //         console.log(`${i} - это ноль`);
        //     } else if (isEven(i)) {
        //         console.log(`${i} - четное число`);
        //     } else {
        //         console.log(`${i} - нечетное число`);
        //     }
        // }
     
        // Задание 2
        // Дан массив [1, 2, 3, 4, 5, 6, 7]
        // Сделайте из этого массива следующий [1, 2, 3, 6, 7]

        // const Array = [1,2,3,4,5,6,7];
        // Array.splice(3,2);
        // console.log(Array);

//         Задание 3
// Используя Math.random() вам необходимо генерировать цифры от 0 до 9, и создать массив состоящий из 5 таких элементов
// 1. Рассчитать сумму элементов этого массива
// 2. Найти минимальное число
// 3. Найти есть ли в этом массиве число 3


    //     const RandomNumber = []
    // for (i = 0; i < 5; i++){
    // console.log(Math.floor(Math.random()*10))}
    // function sum (RandomNumber){
    //     let sum = 0;
    //     for (i = 0; i < RandomNumber.length; i++){
    //        sum += x[i]
    //     }
    //     return sum
    //  }
    //  console.log(sum)
    // const min = Math.min(...RandomNumber)
    // console.log(min)
    
//     Необязательное задание.
// Необходимо вывести горку в консоль (используя цикл for), как показано на
// рисунке, только у вашей горки должно быть 20 рядов, а не 5:
// ```
// x
// xx
// xxx
// xxxx
// xxxxx
// ```
// Примечание: в трех косых кавычках ``` показан пример кода для вывода, вам эти
// кавычки выводить не нужно.
// -->
//     <script>
        
//         for (let i = 1; i < 21; i++){
//             let stroka = ""
//             for (let j = 1; j <= i; j++){
//                 stroka += "x";
//             }
//             console.log(stroka);
//         }
        

        